  
function sqr(~)
    y = [0, 0.000479, 0.006732, 0.026932, 0.058195, 0.074809, 0.030482, 0.120319,0.387483, 0.712619, 0.958924, 0.938074, 0.48283 , 0.472619, 1.802771, 3.16575 , 4.052411, 3.922967, 2.403475, 0.515462, 4.352160;];
    x = 0:0.1:2;
    u = 0:0.01:2;                               %Делим отрезок [0, 2] на 200 точек, с шагом 0.01
    w = 0:0.01:2; 
    a = s();
    for i = 1:200                       
        w(i) = Pol(u(i), a);                       %вычисляем значения полученного полинома в 200 точках
    end
    plot(u, w);                                 %рисуем графи полинома
    for j = 1:21
        plot(x(j), y(j), '.', 'color', 'red');  %Выводим заданные по условию точки на графике
    end
    hold on;                                     %Добавляем сетку на график
    grit on;                                     %Накладываем точки условия, на полученный график
    
    X = ['Полученый полином:', num2str(a(1)), ' + ' , num2str(a(2)), 'x ', '', num2str(a(3)), 'x^2 ', '+ ', num2str(a(4)), 'x^3 ', '', num2str(a(5)), 'x^4'];
    disp(X);
    disp('Погрешность:');
    for i = 1:21
        disp(abs(Pol(x(i), a) - y(i)));
    end
end
function r = Pol(x, a)
    r = a(1) + a(2)*x + a(3)*x^2 + a(4)*x^3 + a(5)*x^4;  %искомый полином
end

function a = s(~)
    y = [0, 0.000479, 0.006732, 0.026932, 0.058195, 0.074809, 0.030482, 0.120319,0.387483, 0.712619, 0.958924, 0.938074, 0.48283 , 0.472619, 1.802771, 3.16575 , 4.052411, 3.922967, 2.403475, 0.515462, 4.352160;];
    x = 0:0.1:2;
    g = [0 0 0 0 0;
         0 0 0 0 0;
         0 0 0 0 0;
         0 0 0 0 0;
         0 0 0 0 0;];
    b = [0;
         0; 
         0;
         0;
         0;];
   
    for l = 0:4
        for i = 1:21
            b(l + 1) = b(l + 1) + (x(i)^l) * y(i);                         %Вычисляем коэффициенты b[l]
        end
        for k = 0:4
            for i = 1:21
                g(l + 1, k + 1) = g(l + 1, k + 1) + (x(i)^l) * (x(i)^k);   %Вычисляем коэффициенты матрицы
            end
        end
    end                                                      
    a = Gauss(g, b);
   
end
function x = Gauss(A, b)      %Решение СЛАУ методом Гаусса
    l = 1;
    N = 5;
    %прямой ход
    for k = 1:N
        if A(k, k) == 0
            l = k;
            while A(k, k) == 0      %Выбор главного элемента
                A = swp(A, k, l);
                l = l + 1;
            end
        end
        tmp = A(k, k);
       
        b(k) = b(k) / tmp;
        for i = k:N
            A(k, i) = A(k, i) / tmp;
      
        end
        
        for j = k + 1:N
            ker = A(j, k);
            b(j) = b(j) - b(k) * ker;
            for i = k:N
                A(j, i) = A(j, i) - A(k, i) * ker;        
            end      
        end       
    end
    %Обратный ход
    for k = N:-1:1
        tmp = A(k, k);
        b(k) = b(k) / tmp;
        A(k, k) = A(k, k) / tmp;
        
        for j = k - 1:-1:1
            ker = A(j, k);
            b(j) = b(j) - b(k) * ker;       
          %  A(j, k) = A(j, k) - A(k, k) * ker ;
        end
    end
    x = b;
end
function B = swp(A, m, n) %Меняет местами m-ую и n-ую строки
    for k = 1:N
        tmp = A(m, k);
        A(m, k) = A(n, k);
        A(n, k) = tmp;
    end
    B = A;
end